1. SCRIPT DE LA BD INICIAL

    Creacion de la BD

In [1]:
IF EXISTS 
   (
     SELECT name
FROM master.dbo.sysdatabases
WHERE name = 'bichos_de_bosillo'
    )
DROP DATABASE bichos_de_bosillo

GO

CREATE DATABASE bichos_de_bosillo

GO

USE bichos_de_bosillo

GO

2. CREACION DE LAS TABLAS

In [2]:
--Tabla Tipos
CREATE TABLE Tipos
(
    tipo_id INT PRIMARY KEY IDENTITY (1 , 1),
    tipo_nombre VARCHAR(20) NOT NULL,
    resistente VARCHAR(20)
)

--Tabla Especies
CREATE TABLE Especies
(
    especie_id INT PRIMARY KEY IDENTITY (1 , 1),
    especie_daño_ataque INT NOT NULL,
    especie_velocidad_ataque INT NOT NULL,
    especie_nombre VARCHAR(20) NOT NULL,
    especie_aumento_salud INT NOT NULL,
    especie_tipo INT FOREIGN KEY REFERENCES Tipos(tipo_id)
)

--Tabla Usuarios
CREATE TABLE Usuarios
(
    usuario_id INT PRIMARY KEY IDENTITY (1,1),
    usuario_nombre VARCHAR(20) NOT NULL
)

--Tabla Catalogo de Ataques
CREATE TABLE Catalogo_Ataques
(
    catalogo_id INT PRIMARY KEY IDENTITY (1,1),
    catalogo_nombre VARCHAR(20) NOT NULL,
    catalogo_nivel INT NOT NULL,
    catalogo_tipo INT FOREIGN KEY REFERENCES Tipos(tipo_id)
)

--Tabla Bichos
CREATE TABLE Bichos
(
    bicho_id INT PRIMARY KEY IDENTITY (1,1),
    bicho_nombre VARCHAR(20) NOT NULL,
    bicho_salud INT DEFAULT 100,
    bicho_tipo INT FOREIGN KEY REFERENCES Tipos(tipo_id),
    bicho_especie INT FOREIGN KEY REFERENCES Especies(especie_id),
    bicho_propietario INT FOREIGN KEY REFERENCES Usuarios(usuario_id) DEFAULT NULL
)

--Tabla Recolecciones
CREATE TABLE Recolecciones
(
    recoleccion_id INT IDENTITY PRIMARY KEY,
    recoleccion_bicho INT FOREIGN KEY REFERENCES Bichos(bicho_id),
    recoleccion_fecha DATE NOT NULL,
    recoleccion_nivel INT DEFAULT 1,
    recoleccion_usuario INT FOREIGN KEY REFERENCES Usuarios(usuario_id)
)

--Tabla Intercambios
CREATE TABLE Intercambios
(
    intercambio_id INT PRIMARY KEY IDENTITY (1,1),
    usuario_uno INT FOREIGN KEY REFERENCES Usuarios(usuario_id),
    usuario_dos INT FOREIGN KEY REFERENCES Usuarios(usuario_id),
    bicho_uno INT FOREIGN KEY REFERENCES Bichos(bicho_id),
    bicho_dos INT FOREIGN KEY REFERENCES Bichos(bicho_id),
    intercambio_fecha DATE NOT NULL
)

--Tabla Combates
CREATE TABLE Combates
(
    combate_id INT PRIMARY KEY IDENTITY (1,1),
    usuario_uno INT FOREIGN KEY REFERENCES Usuarios(usuario_id),
    usuario_dos INT FOREIGN KEY REFERENCES Usuarios(usuario_id),
    combate_fecha DATE NOT NULL
)

--Tabla de Rondas
CREATE TABLE Rondas
(
    ronda_noRonda INT IDENTITY (1,1),
    combate_id INT FOREIGN KEY REFERENCES Combates(combate_id),
    bicho_uno INT FOREIGN KEY REFERENCES Bichos(bicho_id),
    bicho_dos INT FOREIGN KEY REFERENCES Bichos(bicho_id),
    ataque_uno INT FOREIGN KEY REFERENCES Catalogo_Ataques(catalogo_id),
    ataque_dos INT FOREIGN KEY REFERENCES Catalogo_Ataques(catalogo_id),
    nivel_daño_uno INT NOT NULL,
    nivel_daño_dos INT NOT NULL,
    ganador INT FOREIGN KEY REFERENCES Bichos(bicho_id)

        PRIMARY KEY (ronda_noRonda, combate_id)
)

--Tabla de Ataques de Bichos
CREATE TABLE Ataques_Bicho
(
    bicho_id INT FOREIGN KEY REFERENCES Bichos(bicho_id),
    ataque_id INT FOREIGN KEY REFERENCES Catalogo_Ataques(catalogo_id),

    PRIMARY KEY(bicho_id, ataque_id)
)

3. INSERTAR DATOS

In [3]:
--TIPOS
INSERT INTO Tipos
    (tipo_nombre, resistente)
Values
    ('Aire', 'Tierra'),
    ('Tierra', 'Aire'),
    ('Fuego', 'Agua'),
    ('Agua', 'Fuego')

--ESPECIES
INSERT INTO Especies
    (especie_nombre, especie_tipo, especie_aumento_salud, especie_daño_ataque, especie_velocidad_ataque)
VALUES
    ('Eolo', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Aire'), 20, 15, 15),
    ('Boreas', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Aire'), 30, 25, 15),
    ('Vulcano', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Fuego'), 25, 25, 20),
    ('Prometeo', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Fuego'), 15, 20, 10),
    ('Poseidon', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Agua'), 30, 30, 30),
    ('Triton', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Agua'), 20, 15, 10),
    ('Gaia', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Tierra'), 25, 30, 30),
    ('Pan', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Tierra'), 15, 20, 20)

--BICHOS
INSERT INTO Bichos
    (bicho_nombre, bicho_tipo, bicho_especie)
VALUES
    ('Charmander', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Fuego'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Vulcano')),
    ('Charmeleon', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Fuego'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Vulcano')),
    ('Ponyta', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Fuego'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Prometeo')),
    ('Rapidash', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Fuego'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Prometeo')),
    ('Vulpix', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Fuego'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Vulcano')),
    ('Squirtle', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Agua'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Poseidon')),
    ('Wartortle', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Agua'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Poseidon')),
    ('Magikarp', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Agua'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Triton')),
    ('Gyarados', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Agua'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Triton')),
    ('Psyduck', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Agua'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Poseidon')),
    ('Sandshrew', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Tierra'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Gaia')),
    ('Sandslash', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Tierra'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Gaia')),
    ('Diglett', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Tierra'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Pan')),
    ('Dugtrio ', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Tierra'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Pan')),
    ('Graveler', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Tierra'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Gaia')),
    ('Pidgey', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Aire'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Eolo')),
    ('Pidgeotto ', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Aire'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Eolo')),
    ('Spearow', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Aire'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Boreas')),
    ('Fearow', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Aire'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Boreas')),
    ('Charizard', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Aire'), (SELECT especie_id
        FROM Especies
        WHERE especie_nombre = 'Eolo'))

--CATALOGO DE ATAQUES
INSERT INTO Catalogo_Ataques
    (catalogo_nombre, catalogo_tipo, catalogo_nivel)
VALUES
    ('Puño de Fuego', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Fuego'), 1),
    ('Puño de Agua', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Agua'), 1),
    ('Puño de Tierra', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Tierra'), 1),
    ('Puño de Aire', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Aire'), 1),
    ('Huracan', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Agua'), 2),
    ('Viento', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Aire'), 2),
    ('Terremoto', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Tierra'), 2),
    ('Incendio', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Fuego'), 2),
    ('Tormenta', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Agua'), 3),
    ('Volcan', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Fuego'), 3),
    ('Arena Movediza', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Tierra'), 3),
    ('Ventisca', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Aire'), 3),
    ('Tsunami', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Agua'), 4),
    ('Rayo', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Fuego'), 4),
    ('Hierro', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Tierra'), 4),
    ('Tornado', (SELECT tipo_id
        FROM Tipos
        WHERE tipo_nombre = 'Aire'), 4)

--USUARIOS
INSERT INTO Usuarios
    (usuario_nombre)
Values
    ('Lucia'),
    ('Edgar'),
    ('Jose'),
    ('Fabiola'),
    ('Diego')

--RECOLECCIONES
INSERT INTO Recolecciones
    (recoleccion_fecha, recoleccion_bicho, recoleccion_nivel, recoleccion_usuario)
Values
    (GETDATE(), (SELECT bicho_id
        FROM Bichos
        WHERE bicho_nombre = 'Charmander'), 1, (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar')),
    (GETDATE(), (SELECT bicho_id
        FROM Bichos
        WHERE bicho_nombre = 'Diglett'), 2, (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose')),
    (GETDATE(), (SELECT bicho_id
        FROM Bichos
        WHERE bicho_nombre = 'Pidgey'), 3, (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola')),
    (GETDATE(), (SELECT bicho_id
        FROM Bichos
        WHERE bicho_nombre = 'Pidgeotto'), 1, (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego')),
    (GETDATE(), (SELECT bicho_id
        FROM Bichos
        WHERE bicho_nombre = 'Spearow'), 2, (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose')),
    (GETDATE(), (SELECT bicho_id
        FROM Bichos
        WHERE bicho_nombre = 'Gyarados'), 1, (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia')),
    (GETDATE(), (SELECT bicho_id
        FROM Bichos
        WHERE bicho_nombre = 'Squirtle'), 2, (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego')),
    (GETDATE(), (SELECT bicho_id
        FROM Bichos
        WHERE bicho_nombre = 'Psyduck'), 3, (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola')),
    (GETDATE(), (SELECT bicho_id
        FROM Bichos
        WHERE bicho_nombre = 'SandSlash'), 2, (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia')),
    (GETDATE(), (SELECT bicho_id
        FROM Bichos
        WHERE bicho_nombre = 'Charmeleon'), 3, (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola')),
    (GETDATE(), (SELECT bicho_id
        FROM Bichos
        WHERE bicho_nombre = 'Magikarp'), 1, (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar')),
    (GETDATE(), (SELECT bicho_id
        FROM Bichos
        WHERE bicho_nombre = 'Ponyta'), 1, (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego')),
    (GETDATE(), (SELECT bicho_id
        FROM Bichos
        WHERE bicho_nombre = 'Wartortle'), 2, (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar')),
    (GETDATE(), (SELECT bicho_id
        FROM Bichos
        WHERE bicho_nombre = 'Graveler'), 3, (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia')),
    (GETDATE(), (SELECT bicho_id
        FROM Bichos
        WHERE bicho_nombre = 'Charizard'), 2, (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))

--Actualizar el valor bicho_propietario en la tabla de Bichos por las recolecciones que se hicieron
UPDATE Bichos 
SET bicho_propietario = (SELECT usuario_id
FROM Usuarios
WHERE usuario_nombre = 'Edgar')
WHERE bicho_nombre = 'Charmander'
UPDATE Bichos 
SET bicho_propietario = (SELECT usuario_id
FROM Usuarios
WHERE usuario_nombre = 'Jose')
WHERE bicho_nombre = 'Diglett'
UPDATE Bichos 
SET bicho_propietario = (SELECT usuario_id
FROM Usuarios
WHERE usuario_nombre = 'Fabiola')
WHERE bicho_nombre = 'Pidgey'
UPDATE Bichos 
SET bicho_propietario = (SELECT usuario_id
FROM Usuarios
WHERE usuario_nombre = 'Diego')
WHERE bicho_nombre = 'Pidgeotto'
UPDATE Bichos 
SET bicho_propietario = (SELECT usuario_id
FROM Usuarios
WHERE usuario_nombre = 'Jose')
WHERE bicho_nombre = 'Spearow'
UPDATE Bichos 
SET bicho_propietario = (SELECT usuario_id
FROM Usuarios
WHERE usuario_nombre = 'Lucia')
WHERE bicho_nombre = 'Gyarados'
UPDATE Bichos 
SET bicho_propietario = (SELECT usuario_id
FROM Usuarios
WHERE usuario_nombre = 'Diego')
WHERE bicho_nombre = 'Squirtle'
UPDATE Bichos 
SET bicho_propietario = (SELECT usuario_id
FROM Usuarios
WHERE usuario_nombre = 'Fabiola')
WHERE bicho_nombre = 'Psyduck'
UPDATE Bichos 
SET bicho_propietario = (SELECT usuario_id
FROM Usuarios
WHERE usuario_nombre = 'Lucia')
WHERE bicho_nombre = 'SandSlash'
UPDATE Bichos 
SET bicho_propietario = (SELECT usuario_id
FROM Usuarios
WHERE usuario_nombre = 'Fabiola')
WHERE bicho_nombre = 'Charmeleon'
UPDATE Bichos 
SET bicho_propietario = (SELECT usuario_id
FROM Usuarios
WHERE usuario_nombre = 'Edgar')
WHERE bicho_nombre = 'Magikarp'
UPDATE Bichos 
SET bicho_propietario = (SELECT usuario_id
FROM Usuarios
WHERE usuario_nombre = 'Diego')
WHERE bicho_nombre = 'Ponyta'
UPDATE Bichos 
SET bicho_propietario = (SELECT usuario_id
FROM Usuarios
WHERE usuario_nombre = 'Edgar')
WHERE bicho_nombre = 'Wartortle'
UPDATE Bichos 
SET bicho_propietario = (SELECT usuario_id
FROM Usuarios
WHERE usuario_nombre = 'Lucia')
WHERE bicho_nombre = 'Graveler'
UPDATE Bichos 
SET bicho_propietario = (SELECT usuario_id
FROM Usuarios
WHERE usuario_nombre = 'Jose')
WHERE bicho_nombre = 'Charizard'


--ATAQUES DE BICHOS
INSERT INTO Ataques_Bicho
    (bicho_id, ataque_id)
VALUES
    (1, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Fuego')),
    (1, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Huracan')),
    (1, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Terremoto')),
    (1, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Arena Movediza')),
    (1, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Rayo')),
    (2, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Tierra')),
    (2, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Viento')),
    (2, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Incendio')),
    (2, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Arena Movediza')),
    (2, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Ventisca')),
    (3, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Ventisca')),
    (3, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Volcan')),
    (3, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Hierro')),
    (3, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Tormenta')),
    (3, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Tierra')),
    (4, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Agua')),
    (4, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Viento')),
    (4, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Ventisca')),
    (4, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Aire')),
    (4, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Rayo')),
    (5, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Tierra')),
    (5, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Incendio')),
    (5, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Hierro')),
    (5, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Aire')),
    (5, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Viento')),
    (6, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Fuego')),
    (6, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Ventisca')),
    (6, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Terremoto')),
    (6, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Arena Movediza')),
    (6, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Hierro')),
    (7, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Agua')),
    (7, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Tsunami')),
    (7, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Hierro')),
    (7, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Arena Movediza')),
    (7, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Rayo')),
    (8, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Fuego')),
    (8, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Incendio')),
    (8, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Ventisca')),
    (8, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Tormenta')),
    (8, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Viento')),
    (9, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Fuego')),
    (9, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Ventisca')),
    (9, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Volcan')),
    (9, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Hierro')),
    (9, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Incendio')),
    (10, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Agua')),
    (10, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Viento')),
    (10, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Tsunami')),
    (10, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Arena Movediza')),
    (10, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Aire')),
    (11, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Ventisca')),
    (11, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Huracan')),
    (11, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Hierro')),
    (11, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Tormenta')),
    (11, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Incendio')),
    (12, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Tierra')),
    (12, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Incendio')),
    (12, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Terremoto')),
    (12, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Volcan')),
    (12, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Viento')),
    (13, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Fuego')),
    (13, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Huracan')),
    (13, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Terremoto')),
    (13, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Arena Movediza')),
    (13, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Aire')),
    (14, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Agua')),
    (14, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Huracan')),
    (14, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Hierro')),
    (14, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Arena Movediza')),
    (14, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Incendio')),
    (15, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Fuego')),
    (15, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Huracan')),
    (15, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Tsunami')),
    (15, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Tormenta')),
    (15, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Hierro')),
    (16, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Fuego')),
    (16, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Ventisca')),
    (16, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Incendio')),
    (16, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Volcan')),
    (16, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Viento')),
    (17, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Tierra')),
    (17, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Huracan')),
    (17, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Hierro')),
    (17, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Arena Movediza')),
    (17, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Rayo')),
    (18, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Fuego')),
    (18, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Aire')),
    (18, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Terremoto')),
    (18, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Tormenta')),
    (18, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Incendio')),
    (19, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Agua')),
    (19, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Ventisca')),
    (19, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Terremoto')),
    (19, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Volcan')),
    (19, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Aire')),
    (20, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Puño de Fuego')),
    (20, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Viento')),
    (20, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Tsunami')),
    (20, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Arena Movediza')),
    (20, (SELECT catalogo_id
        FROM Catalogo_Ataques
        WHERE catalogo_nombre = 'Rayo'))

--INTERCAMBIOS
INSERT INTO Intercambios
    (intercambio_fecha, usuario_uno, usuario_dos, bicho_uno, bicho_dos)
Values
    (GETDATE(), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), 1, 13),
    (GETDATE(), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), 18, 3),
    (GETDATE(), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), 9, 10),
    (GETDATE(), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), 2, 7),
    (GETDATE(), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), 6, 20),
    (GETDATE(), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), 16, 12),
    (GETDATE(), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), 15, 17)

    Insertar datos en Combates y Rondas (100 c/u)

In [4]:
INSERT INTO Combates
    (usuario_uno, usuario_dos, combate_fecha)
VALUES
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'), GETDATE()),
    ((SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'), (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'), GETDATE())




INSERT INTO Rondas
    (combate_id, bicho_uno, bicho_dos, ataque_uno, ataque_dos, nivel_daño_uno, nivel_daño_dos, ganador)
VALUES
    (58, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1),
        7, 15, 86, 22,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'))
,
    (78, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3),
        13, 11, 24, 48,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (68, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 3),
        7, 15, 79, 66,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (1, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3),
        12, 11, 91, 62,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (76, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 1),
        8, 7, 53, 51,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'))
,
    (96, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 3),
        2, 1, 30, 1,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (7, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 2),
        12, 2, 72, 66,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'))
,
    (10, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 1),
        5, 10, 20, 5,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (97, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3),
        16, 5, 42, 70,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (88, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 3),
        16, 10, 99, 63,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (69, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 2),
        12, 11, 21, 43,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (27, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 1),
        9, 14, 31, 56,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (89, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 2),
        11, 11, 74, 73,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (23, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 1),
        7, 16, 84, 73,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (20, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 1),
        8, 9, 72, 13,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'))
,
    (55, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 1),
        5, 10, 9, 54,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'))
,
    (37, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3),
        7, 14, 69, 64,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (33, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 1),
        10, 3, 51, 17,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'))
,
    (15, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 2),
        6, 9, 97, 96,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (46, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3),
        3, 13, 9, 55,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (35, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 2),
        4, 12, 39, 23,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'))
,
    (89, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 1),
        4, 11, 59, 63,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (21, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 1),
        13, 3, 20, 84,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'))
,
    (59, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 1),
        3, 3, 42, 90,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (89, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 2),
        3, 1, 33, 63,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (3, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 3),
        8, 7, 82, 2,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'))
,
    (63, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 1),
        2, 10, 97, 6,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'))
,
    (12, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1),
        10, 4, 2, 22,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (83, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 1),
        14, 5, 29, 69,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (93, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 3),
        8, 7, 51, 90,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'))
,
    (51, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 1),
        1, 6, 23, 74,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (26, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 1),
        14, 8, 78, 95,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (43, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1),
        14, 7, 24, 48,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (64, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 3),
        6, 14, 52, 47,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'))
,
    (90, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 2),
        7, 6, 7, 93,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'))
,
    (68, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1),
        15, 16, 59, 1,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (20, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3),
        1, 11, 6, 73,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (11, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 3),
        2, 16, 70, 43,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'))
,
    (22, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 2),
        4, 10, 84, 66,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (78, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 2),
        9, 8, 29, 55,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (39, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 1),
        1, 2, 26, 29,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (97, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 2),
        8, 11, 11, 62,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (25, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3),
        16, 6, 36, 25,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'))
,
    (38, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3),
        6, 4, 82, 95,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (86, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 1),
        7, 16, 97, 55,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'))
,
    (72, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3),
        12, 11, 5, 87,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (43, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 2),
        5, 1, 89, 17,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (42, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 2),
        14, 15, 75, 82,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (98, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 2),
        3, 3, 86, 41,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (87, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 2),
        11, 16, 14, 87,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (46, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 2),
        3, 10, 57, 69,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (5, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 2),
        15, 4, 47, 72,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (77, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1),
        8, 14, 84, 46,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (61, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 2),
        16, 14, 0, 74,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (56, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 2),
        6, 2, 85, 98,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (73, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3),
        5, 8, 69, 25,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (88, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1),
        12, 13, 78, 30,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (80, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1),
        6, 10, 91, 67,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'))
,
    (1, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3),
        7, 16, 56, 56,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (75, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 1),
        15, 14, 13, 6,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (48, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 2),
        16, 14, 39, 14,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (81, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 1),
        9, 4, 49, 12,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (92, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 1),
        13, 3, 5, 33,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'))
,
    (97, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 2),
        13, 12, 75, 79,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (36, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 3),
        6, 9, 94, 58,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (54, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3),
        12, 12, 78, 55,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'))
,
    (4, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 1),
        2, 14, 83, 98,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (70, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 1),
        1, 1, 12, 26,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'))
,
    (78, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3),
        1, 6, 86, 85,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (2, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 3),
        6, 4, 70, 49,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (36, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 2),
        3, 12, 8, 54,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'))
,
    (3, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 1),
        1, 13, 33, 75,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'))
,
    (24, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 1),
        16, 4, 0, 44,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (25, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 2),
        16, 13, 68, 96,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (36, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 2),
        6, 4, 66, 78,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Diego'))
,
    (54, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 1),
        14, 11, 77, 46,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'))
,
    (85, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 1),
        9, 16, 10, 91,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'))
,
    (75, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 2),
        15, 13, 93, 68,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (31, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3),
        11, 14, 1, 40,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (85, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 1),
        1, 12, 54, 74,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'))
,
    (42, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1),
        4, 1, 48, 76,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (43, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 2),
        10, 13, 21, 7,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (19, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1),
        8, 4, 24, 26,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (80, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1),
        15, 13, 13, 47,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (46, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 1),
        15, 12, 25, 66,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (77, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1),
        1, 14, 6, 70,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (95, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 1),
        13, 16, 95, 23,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (73, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 1),
        2, 16, 9, 87,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (50, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3),
        5, 3, 31, 19,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (6, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 2),
        16, 11, 75, 85,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (93, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 3),
        8, 9, 53, 13,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (48, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 3),
        12, 13, 15, 19,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'))
,
    (87, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 2),
        13, 1, 14, 35,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Fabiola'))
,
    (73, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3),
        4, 5, 28, 79,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (95, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Fabiola')) AS Bichillos
        WHERE row_number = 3),
        9, 15, 71, 58,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (83, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 3),
        16, 15, 76, 78,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (49, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 1),
        15, 7, 75, 65,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'))
,
    (6, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Edgar')) AS Bichillos
        WHERE row_number = 2),
        9, 9, 14, 59,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Edgar'))
,
    (31, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 2), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Jose')) AS Bichillos
        WHERE row_number = 2),
        4, 16, 15, 43,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Jose'))
,
    (65, (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Lucia')) AS Bichillos
        WHERE row_number = 1), (SELECT bicho_id
        FROM
            (SELECT
                ROW_NUMBER() OVER(order by (select 1)) as row_number,
                bicho_id
            FROM Bichos
            WHERE bicho_propietario = (SELECT usuario_id
            FROM Usuarios
            WHERE usuario_nombre = 'Diego')) AS Bichillos
        WHERE row_number = 3),
        2, 15, 86, 3,
        (SELECT usuario_id
        FROM Usuarios
        WHERE usuario_nombre = 'Lucia'))

4. CONSULTA DE DATOS

In [5]:
SELECT
    tipo_id AS 'ID',
    tipo_nombre AS 'Nombre de los Tipos',
    resistente AS 'Resistente a'

FROM Tipos;


SELECT
    especie_id AS 'ID',
    especie_nombre AS 'Nombre de la Especie',
    especie_tipo AS 'ID del Tipo',
    especie_aumento_salud AS 'Aumento de Salud',
    especie_daño_ataque AS 'Daño de Ataque',
    especie_velocidad_ataque AS 'Velocidad de Ataque'

FROM Especies;


SELECT
    bicho_id AS 'ID',
    bicho_nombre AS 'Nombre del Bicho',
    bicho_salud AS 'Salud',
    bicho_tipo AS 'Tipo',
    bicho_especie AS 'Especie',
    bicho_propietario AS 'Propietario ID',
    (SELECT usuario_nombre
    FROM Usuarios
    WHERE usuario_id = bicho_propietario) AS 'Propietario Nombre'

FROM Bichos;


SELECT
    catalogo_id AS 'ID',
    catalogo_nombre AS 'Nombre del Ataque',
    catalogo_tipo AS 'ID del Tipo',
    catalogo_nivel AS 'Nivel de Ataque'

FROM Catalogo_Ataques;


SELECT
    usuario_id AS 'ID',
    usuario_nombre AS 'Nombre del Usuario'
FROM Usuarios;


SELECT
    recoleccion_fecha AS 'Fecha de Recoleccion',
    recoleccion_bicho AS 'ID Bicho',
    recoleccion_nivel AS 'Nivel',
    recoleccion_usuario AS 'Usuario'

FROM Recolecciones;

SELECT
    intercambio_id AS 'ID',
    intercambio_fecha AS 'Fecha del Intercambio',
    usuario_uno AS 'Usuario 1',
    usuario_dos AS 'Usuario 2',
    bicho_uno AS 'Bicho del Usuario1',
    bicho_dos AS 'Bicho del Usuario2'

FROM Intercambios;

SELECT
    bicho_id AS "Bicho",
    ataque_id AS "Ataque"
FROM Ataques_Bicho

SELECT
    combate_id AS 'ID',
    usuario_uno AS 'Jugador 1',
    usuario_dos AS 'Jugador 2',
    combate_fecha AS 'Fecha'
FROM Combates

SELECT
    combate_id AS 'Combate',
    bicho_uno AS 'Bicho 1',
    bicho_dos AS 'Bicho 2',
    ataque_uno AS 'Ataque 1',
    ataque_dos AS 'Ataque 2',
    nivel_daño_uno AS 'Daño 1',
    nivel_daño_dos AS 'Daño 2',
    ganador AS 'Ganador'
FROM Rondas
ORDER BY combate_id

ID,Nombre de los Tipos,Resistente a
1,Aire,Tierra
2,Tierra,Aire
3,Fuego,Agua
4,Agua,Fuego

ID,Nombre de la Especie,ID del Tipo,Aumento de Salud,Daño de Ataque,Velocidad de Ataque
1,Eolo,1,20,15,15
2,Boreas,1,30,25,15
3,Vulcano,3,25,25,20
4,Prometeo,3,15,20,10
5,Poseidon,4,30,30,30
6,Triton,4,20,15,10
7,Gaia,2,25,30,30
8,Pan,2,15,20,20

ID,Nombre del Bicho,Salud,Tipo,Especie,Propietario ID,Propietario Nombre
1,Charmander,100,3,3,2,Edgar
2,Charmeleon,100,3,3,4,Fabiola
3,Ponyta,100,3,4,5,Diego
4,Rapidash,100,3,4,NULL,NULL
5,Vulpix,100,3,3,NULL,NULL
6,Squirtle,100,4,5,5,Diego
7,Wartortle,100,4,5,2,Edgar
8,Magikarp,100,4,6,2,Edgar
9,Gyarados,100,4,6,1,Lucia
10,Psyduck,100,4,5,4,Fabiola
11,Sandshrew,100,2,7,NULL,NULL
12,Sandslash,100,2,7,1,Lucia
13,Diglett,100,2,8,3,Jose
14,Dugtrio,100,2,8,NULL,NULL
15,Graveler,100,2,7,1,Lucia
16,Pidgey,100,1,1,4,Fabiola
17,Pidgeotto,100,1,1,5,Diego
18,Spearow,100,1,2,3,Jose
19,Fearow,100,1,2,NULL,NULL
20,Charizard,100,1,1,3,Jose

ID,Nombre del Ataque,ID del Tipo,Nivel de Ataque
1,Puño de Fuego,3,1
2,Puño de Agua,4,1
3,Puño de Tierra,2,1
4,Puño de Aire,1,1
5,Huracan,4,2
6,Viento,1,2
7,Terremoto,2,2
8,Incendio,3,2
9,Tormenta,4,3
10,Volcan,3,3
11,Arena Movediza,2,3
12,Ventisca,1,3
13,Tsunami,4,4
14,Rayo,3,4
15,Hierro,2,4
16,Tornado,1,4

ID,Nombre del Usuario
1,Lucia
2,Edgar
3,Jose
4,Fabiola
5,Diego

Fecha de Recoleccion,ID Bicho,Nivel,Usuario
2020-06-01,1,1,2
2020-06-01,13,2,3
2020-06-01,16,3,4
2020-06-01,17,1,5
2020-06-01,18,2,3
2020-06-01,9,1,1
2020-06-01,6,2,5
2020-06-01,10,3,4
2020-06-01,12,2,1
2020-06-01,2,3,4
2020-06-01,8,1,2
2020-06-01,3,1,5
2020-06-01,7,2,2
2020-06-01,15,3,1
2020-06-01,20,2,3

ID,Fecha del Intercambio,Usuario 1,Usuario 2,Bicho del Usuario1,Bicho del Usuario2
1,2020-06-01,2,3,1,2
2,2020-06-01,3,5,5,4
3,2020-06-01,1,4,6,3
4,2020-06-01,4,2,10,8
5,2020-06-01,5,3,12,15
6,2020-06-01,4,1,10,14
7,2020-06-01,1,5,9,7
8,2020-06-01,2,4,2,8
9,2020-06-01,5,2,4,1
10,2020-06-01,3,1,5,6

Bicho,Ataque
1,1
1,5
1,7
1,11
1,14
2,3
2,6
2,8
2,11
2,12
3,3
3,9
3,10
3,12
3,15
4,2
4,4
4,6
4,12
4,14
5,3
5,4
5,6
5,8
5,15
6,1
6,7
6,11
6,12
6,15
7,2
7,11
7,13
7,14
7,15
8,1
8,6
8,8
8,9
8,12
9,1
9,8
9,10
9,12
9,15
10,2
10,4
10,6
10,11
10,13
11,5
11,8
11,9
11,12
11,15
12,3
12,6
12,7
12,8
12,10
13,1
13,4
13,5
13,7
13,11
14,2
14,5
14,8
14,11
14,15
15,1
15,5
15,9
15,13
15,15
16,1
16,6
16,8
16,10
16,12
17,3
17,5
17,11
17,14
17,15
18,1
18,4
18,7
18,8
18,9
19,2
19,4
19,7
19,10
19,12
20,1
20,6
20,11
20,13
20,14

ID,Jugador 1,Jugador 2,Fecha
1,4,3,2020-06-01
2,2,5,2020-06-01
3,1,5,2020-06-01
4,5,4,2020-06-01
5,1,3,2020-06-01
6,5,2,2020-06-01
7,5,4,2020-06-01
8,5,1,2020-06-01
9,2,5,2020-06-01
10,2,4,2020-06-01
11,5,1,2020-06-01
12,1,2,2020-06-01
13,3,2,2020-06-01
14,4,1,2020-06-01
15,2,5,2020-06-01
16,2,3,2020-06-01
17,3,1,2020-06-01
18,3,1,2020-06-01
19,1,2,2020-06-01
20,5,3,2020-06-01
21,5,1,2020-06-01
22,4,3,2020-06-01
23,4,3,2020-06-01
24,2,3,2020-06-01
25,5,4,2020-06-01
26,5,4,2020-06-01
27,2,4,2020-06-01
28,5,3,2020-06-01
29,2,1,2020-06-01
30,1,4,2020-06-01
31,1,3,2020-06-01
32,2,4,2020-06-01
33,5,1,2020-06-01
34,1,4,2020-06-01
35,1,5,2020-06-01
36,3,5,2020-06-01
37,2,4,2020-06-01
38,1,4,2020-06-01
39,5,3,2020-06-01
40,5,4,2020-06-01
41,3,1,2020-06-01
42,4,2,2020-06-01
43,3,2,2020-06-01
44,2,1,2020-06-01
45,2,4,2020-06-01
46,3,4,2020-06-01
47,5,4,2020-06-01
48,4,1,2020-06-01
49,1,5,2020-06-01
50,2,3,2020-06-01
51,5,3,2020-06-01
52,1,2,2020-06-01
53,1,4,2020-06-01
54,1,4,2020-06-01
55,2,1,2020-06-01
56,1,4,2020-06-01
57,2,1,2020-06-01
58,5,2,2020-06-01
59,5,3,2020-06-01
60,5,2,2020-06-01
61,5,4,2020-06-01
62,3,2,2020-06-01
63,1,3,2020-06-01
64,5,1,2020-06-01
65,1,5,2020-06-01
66,5,1,2020-06-01
67,5,2,2020-06-01
68,3,2,2020-06-01
69,1,2,2020-06-01
70,3,5,2020-06-01
71,3,2,2020-06-01
72,2,4,2020-06-01
73,2,3,2020-06-01
74,1,5,2020-06-01
75,4,1,2020-06-01
76,5,3,2020-06-01
77,4,2,2020-06-01
78,2,3,2020-06-01
79,1,5,2020-06-01
80,1,2,2020-06-01
81,2,5,2020-06-01
82,3,5,2020-06-01
83,1,3,2020-06-01
84,4,1,2020-06-01
85,4,1,2020-06-01
86,1,3,2020-06-01
87,1,4,2020-06-01
88,4,2,2020-06-01
89,4,3,2020-06-01
90,4,5,2020-06-01
91,5,3,2020-06-01
92,1,5,2020-06-01
93,3,5,2020-06-01
94,3,1,2020-06-01
95,3,4,2020-06-01
96,4,5,2020-06-01
97,4,3,2020-06-01
98,4,5,2020-06-01
99,3,1,2020-06-01
100,2,5,2020-06-01

Combate,Bicho 1,Bicho 2,Ataque 1,Ataque 2,Daño 1,Daño 2,Ganador
1,2,20,12,11,91,62,4
1,2,20,7,16,56,56,3
2,1,17,6,4,70,49,2
3,15,3,1,13,33,75,5
3,15,17,8,7,82,2,1
4,3,2,2,14,83,98,4
5,15,18,15,4,47,72,3
6,17,7,16,11,75,85,2
6,3,7,9,9,14,59,2
7,6,10,12,2,72,66,5
10,1,2,5,10,20,5,2
11,17,15,2,16,70,43,5
12,9,1,10,4,2,22,2
15,1,6,6,9,97,96,2
19,15,1,8,4,24,26,2
20,6,13,8,9,72,13,5
20,6,20,1,11,6,73,3
21,17,9,13,3,20,84,1
22,16,18,4,10,84,66,4
23,10,13,7,16,84,73,4
24,1,13,16,4,0,44,3
25,3,10,16,13,68,96,4
25,6,16,16,6,36,25,5
26,6,2,14,8,78,95,4
27,7,2,9,14,31,56,4
31,15,20,11,14,1,40,3
31,12,18,4,16,15,43,3
33,3,9,10,3,51,17,5
35,12,6,4,12,39,23,1
36,13,6,6,4,66,78,5
36,20,17,6,9,94,58,3
36,20,6,3,12,8,54,5
37,7,16,7,14,69,64,2
38,12,16,6,4,82,95,4
39,17,13,1,2,26,29,3
42,2,7,14,15,75,82,2
42,10,1,4,1,48,76,2
43,20,7,10,13,21,7,3
43,18,7,5,1,89,17,3
43,20,1,14,7,24,48,2
46,20,16,3,13,9,55,4
46,18,10,3,10,57,69,4
46,18,2,15,12,25,66,4
48,10,15,12,13,15,19,1
48,2,12,16,14,39,14,4
49,9,3,15,7,75,65,1
50,1,20,5,3,31,19,2
51,6,13,1,6,23,74,3
54,12,16,12,12,78,55,1
54,12,2,14,11,77,46,1
55,1,9,5,10,9,54,1
56,12,10,6,2,85,98,4
58,6,1,7,15,86,22,5
59,6,13,3,3,42,90,3
61,6,10,16,14,0,74,4
63,12,13,2,10,97,6,1
64,17,15,6,14,52,47,5
65,9,17,2,15,86,3,1
68,18,1,15,16,59,1,3
68,20,8,7,15,79,66,3
69,15,7,12,11,21,43,2
70,18,3,1,1,12,26,5
72,8,16,12,11,5,87,4
73,1,20,5,8,69,25,2
73,1,20,4,5,28,79,3
73,1,13,2,16,9,87,3
75,16,12,15,13,93,68,4
75,16,9,15,14,13,6,4
76,17,13,8,7,53,51,5
77,16,1,8,14,84,46,4
77,16,1,1,14,6,70,2
78,8,18,9,8,29,55,3
78,1,20,1,6,86,85,2
78,8,20,13,11,24,48,3
80,12,1,15,13,13,47,2
80,12,1,6,10,91,67,1
81,1,3,9,4,49,12,2
83,15,13,14,5,29,69,3
83,12,20,16,15,76,78,3
85,16,9,1,12,54,74,1
85,16,9,9,16,10,91,1
86,15,13,7,16,97,55,1
87,12,10,11,16,14,87,4
87,12,10,13,1,14,35,4
88,16,1,12,13,78,30,4
88,16,8,16,10,99,63,4
89,10,18,11,11,74,73,4
89,16,18,3,1,33,63,3
89,10,13,4,11,59,63,3
90,16,6,7,6,7,93,5
92,9,3,13,3,5,33,5
93,13,17,8,7,51,90,5
93,20,17,8,9,53,13,3
95,20,2,13,16,95,23,3
95,18,16,9,15,71,58,3
96,16,17,2,1,30,1,4
97,10,20,16,5,42,70,3
97,10,18,13,12,75,79,3
97,10,18,8,11,11,62,3
98,16,6,3,3,86,41,4